---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternallyTaggedNonBReps
source: html/a95ac322-4ea7-a33b-d4da-022d58fe7b2d.htm
---
# ExternallyTaggedNonBReps Properties

Specifies whether the .NET object represents a valid Revit entity.